---
kind: method
id: M:Autodesk.Revit.DB.TableSectionData.GetCellParamId(System.Int32)
source: html/d6428c3b-aed0-be04-f3d0-7ef619c423e8.htm
---
# Autodesk.Revit.DB.TableSectionData.GetCellParamId Method

Returns a column's ParamId

## Syntax (C#)
```csharp
public ElementId GetCellParamId(
	int nCol
)
```

## Parameters
- **nCol** (`System.Int32`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - The given column number nCol is invalid.